[
  "The male gypsy moth can \"smell\" the virgin female gypsy moth from 1.8 miles away.  ",
  "Lee Harvey Oswald's cadaver tag sold at an auction for $6,600 in 1992.",
  "Americans on the average eat 18 acres of pizza every day.",
  "About 500 movies are made in the US and 800 in India annually.",
  "If you put a drop of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "Almonds are members of the peach family.",
  "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes.",
  "A Boeing 747s wingspan is longer than the Wright brother's first flight.",
  "Adolf Hitler's mother seriously considered having an abortion but was talked out of it by her doctor.",
  "Dentists have recommended that a toothbrush be kept at least 6 feet away from a toilet to avoid airborne particles resulting from the flush.",
  "Recycling one glass jar, saves enough energy to watch T.V for 3 hours!",
  "The Pentagon, in Arlington, Virginia, has twice as many bathrooms as is necessary, because when it was built in the 1940s, the state of Virginia still had segregation laws requiring separate toilet facilities for blacks and whites.",
  "The average person`s left hand does 56% of the typing.",
  "A Boeing 747`s wingspan is longer than the Wright brother`s first flight.",
  "Hummingbirds are the only animals that can fly backwards. ",
  "Humphrey Bogart NEVER said “Play it again, Sam” in Casablanca",
  "Crocodiles and alligators are surprisingly fast on land.  Although they are rapid, they are not agile.  So, if being chased by one, run in a zigzag line to lose him or her.",
  "Weatherman Willard Scott was the first original Ronald McDonald.",
  "The sperm of a mouse is actually longer than the sperm of an elephant.",
  "If one places a tiny amount of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "Every time you lick a stamp, you're consuming 1/10 of a calorie.",
  "Mr. Rogers is an ordained minister.",
  "Bob Dylan's real name is Robert Zimmerman.",
  "Average life span of a major league baseball: 7 pitches.",
  "The scene where Indiana Jones shoots the swordsman in Raider’s of the Lost Ark was Harrison Ford's idea so that he could take a bathroom break.",
  "The 3 most valuable brand names on earth are Marlboro, Coca-Cola, and Budweiser (in that order).",
  "Right handed people live, on average, nine years longer than left-handed people",
  "Women manage the money and pay the bills in  75% of all Americans households.",
  "Most collect calls are made on father`s day.",
  "When the Titanic sank, 2228 people were on it. Only 706 survived.",
  "A piece of paper can be folded no more then 9 times.",
  "Elephants are the only mammals that cannot jump.",
  "The Simpsons is the longest running animated series on TV.",
  "A crocodiles tongue is attached to the roof of its mouth.",
  "Cats have over 100 vocal sounds; dogs only have 10.",
  "A cockroach can live several weeks with its head cut off!",
  "During a severe windstorm or rainstorm the Empire State Building sways several feet to either side.",
  "The average person spends 6 months of their life sitting at red lights.",
  "Ants closely resemble human manners:  When they wake, they stretch & appear to yawn in a human manner before taking up the tasks of the day.",
  "A crocodile cannot stick its tongue out.",
  "Over 60% of all those who marry get divorced.",
  "The value of Pi will be officially \"rounded down\" to 3.14 from 3.14159265359 on December 31, 1999.",
  "An ant always falls over on its right side when intoxicated.",
  "Isaac Asimov is the only author to have a book in every Dewey-decimal category.",
  "Babies are born without kneecaps. They don`t appear until the child reaches 2-6 years of age.",
  "For some time Frederic Chopin, the composer and pianist, wore a beard on only one side of his face, explaining: \"It does not matter, my audience sees only my right side.\"",
  "The dot over the letter `i` is called a tittle.  ",
  "Ninety percent of New York City cabbies are recently arrived immigrants.",
  "During the chariot scene in \"Ben Hur,\" a small red car can be seen in the distance.",
  "Venus and Uranus are the only planets that rotate opposite to the direction of their orbit."
]